Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །ཆོས་བསྟན་པ་འདི་ལ་ནི་སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བར་བཏགས་པ་མེད་དོ།
en: In this teaching of the Dharma, there is no conception of the sense fields, the sensory elements, or the links of dependent origination.

source: །ཆོས་བསྟན་པ་འདི་ལ་ནི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པར་བཏགས་པ་མེད་དོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: In this teaching of the Dharma, there is no conception of the perfection of generosity, and there is no conception of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པར་བཏགས་པ་མེད་དོ། །ཆོས་བསྟན་པ་འདི་ལ་ནི་ནང་སྟོང་པ་ཉིད་དུ་བཏགས་པ་མེད་དོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་བཏགས་པ་མེད་དོ།
en: In this teaching of the Dharma, there is no conception of the emptiness of internal phenomena and there is no conception of the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities. “

source: །ཆོས་བསྟན་པ་འདི་ལ་ནི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དུ་བཏགས་པ་མེད་དོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: In this Dharma, there no conception of the thirty-seven factors conducive to enlightenment.

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་།
en: There is no conception of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, {Ki.

source: གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དུ་བཏགས་པ་མེད་དོ།
en: II-III: 14} the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, or the eighteen distinct qualities of the buddhas. “

source: །ཆོས་བསྟན་པ་འདི་ལ་ནི་རྒྱུན་དུ་ཞུགས་པར་བཏགས་པ་མེད་དོ། །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུར་བཏགས་པ་མེད་དོ། །ལན་ཅིག་ཕྱིར་འོང་བ་དང་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་།
en: In this Dharma, there is no conception of entering the stream to nirvāṇa, and there is no conception of the fruit of entering the stream to nirvāṇa.

source: རང་སངས་རྒྱས་རྣམས་དང་། རང་བྱང་ཆུབ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་རྣམས་དང་། སངས་རྒྱས་དང་བྱང་ཆུབ་དུ་བཏགས་པ་མེད་དོ།
en: There is no conception of being destined for only one more rebirth, of the fruit of being destined for only one more rebirth, of no longer being subject to further rebirth, of the fruit of no longer being subject to rebirth, of arhatship, of pratyekabuddhas, of individual enlightenment, of the bodhisattva levels, or of the buddhas and enlightenment.

source: ཡི་གེར་བཏགས་པ་མེད་དོ།
en: There is no conception of syllables.”

source: །སྙམ་པ་དང་དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་ལྷའི་བུ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷའི་བུ་དག་དེ་དེ་བཞིན་ནོ།
en: Then the venerable Subhūti said to these gods, “Divine princes! It is so!

source: དེ་བཞིན་གཤེགས་པའི་བྱང་ཆུབ་ནི་བརྗོད་དུ་མེད་དོ། །སྨྲར་མེད་དོ།
en: The enlightenment of the tathāgatas is inexpressible, and it cannot be spoken.

source: །དེ་ནི་སུས་ཀྱང་བསྟན་པ་མེད་དོ།
en: It cannot be taught by anyone.

source: །སུས་ཀྱང་ཤེས་པ་མེད་དོ།
en: It cannot be known by anyone. Divine princes!

source: །ལྷའི་བུ་དག་དེ་ལྟ་བས་ན་ལ་ལ་ཞིག་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་གནས་པར་འདོད་ཅིང་། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་དུ་བྱ་བར་འདོད་ན་ཡང་བཟོད་པ་འདི་ལ་མི་རྟེན་དུ་མི་རུང་ངོ་།
en: So it is that those who seek to dwell in the fruit of entering the stream to nirvāṇa, or who seek to actualize the fruit of entering the stream to nirvāṇa, cannot do so without relying on accepting this.

source: །ལ་ལ་ཞིག་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། ལ་ལ་ཞིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་གནས་པར་འདོད་ཅིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་དུ་བྱ་བར་འདོད་ན་ཡང་།
en: Those who seek to dwell on the fruit of being destined for only one more rebirth, on the fruit of no longer being subject to further rebirth, on arhatship, on individual enlightenment, and those who seek to dwell on unsurpassed, complete enlightenment, or who seek to actualize unsurpassed, complete enlightenment, cannot do so without relying on this acceptance.

source: བཟོད་པ་འདི་ལ་མི་རྟེན་དུ་མི་རུང་ངོ་། །ལྷའི་བུ་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་དང་པོ་བསྐྱེད་ནས་བརྗོད་པ་དང་། མཉན་དུ་མེད་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པར་བྱའོ།
en: In this way, divine princes, bodhisattva great beings, starting from the time when they first begin to set their mind on enlightenment onward, should dwell in the perfection of wisdom, because it cannot be expressed and it cannot be heard.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་བཅུ་བཞི་པའོ།། །།
en: This completes the fourteenth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་ལྷའི་བུ་དེ་དག་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ། གནས་བརྟན་རབ་འབྱོར་ལ་ཆོས་མཉན་པ་རྣམ་པ་ཇི་ལྟ་བུ་དག་བཙལ་བར་བྱ་སྙམ་པ་དང་།
en: Chapter 15 Then the gods thought, “What should those who hear the Dharma from the elder Subhūti seek to be?”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། ལྷའི་བུ་དེ་དག་གི་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་སེམས་ཀྱིས་ཡོངས་སུ་ཤེས་ནས། ལྷའི་བུ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Thereupon the venerable Subhūti, knowing in his own mind the thoughts in the minds of those gods, said to them, “Divine princes!

source: །ལྷའི་བུ་དག་བདག་གིས་ཆོས་བསྟན་པ་ནི་སྒྱུ་མ་ལྟ་བུ་སྟེ།
en: The Dharma taught by me resembles a magical display. Divine princes!

source: ལྷའི་བུ་དག་བདག་ལ་ཆོས་ཉན་པ་ཡང་སྒྱུ་མ་ལྟ་བུར་བཙལ་བར་བྱའོ། །ལྷའི་བུ་བདག་གི་ཆོས་བསྟན་པ་འདི་སྤྲུལ་པ་ལྟ་བུ་སྟེ།
en: Those who listen to my Dharma should also seek to resemble a magical display. Divine princes! The Dharma taught by me resembles a phantom. Divine princes!

source: བདག་ལ་ཆོས་ཉན་པ་ཡང་སྤྲུལ་པ་ལྟ་བུར་བཙལ་བར་བྱ་སྟེ།
en: Those who listen to my Dharma should also seek to resemble a phantom.

source: དེ་དག་ནི་ཅི་ཡང་ཉན་པ་མེད་ཅིང་ཅི་ཡང་མངོན་དུ་བྱེད་པ་མེད་དོ།
en: They will not hear anything at all, nor will they actualize anything at all.”

source: །དེ་ནས་ལྷའི་བུ་དེ་དག་གིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་རབ་འབྱོར་ཅི་སེམས་ཅན་དེ་དག་སྒྱུ་མ་ལྟ་བུ་སྟེ། ཆོས་ཉན་པ་དེ་དག་སྒྱུ་མ་ལྟ་བུ་ཡིན་ནམ།
en: Then the gods inquired of the venerable Subhūti, “Blessed Subhūti, are those beings like a magical display, and are those who listen to the Dharma like a magical display?

source: སེམས་ཅན་དེ་དག་སྤྲུལ་པ་ལྟ་བུ་སྟེ། ཆོས་ཉན་པ་དེ་དག་སྤྲུལ་པ་ལྟ་བུ་ཡིན་ནམ། རབ་འབྱོར་གྱིས་སྨྲས་པ།
en: Are those beings like a phantom, and are those who listen to the Dharma like a phantom?” “

source: ལྷའི་བུ་དག་དེ་དེ་བཞིན་ནོ།
en: Divine princes, it is so!

source: སེམས་ཅན་དེ་དག་ནི་སྒྱུ་མ་ལྟ་བུ་སྟེ། ཆོས་ཉན་པ་དེ་དག་ཀྱང་སྒྱུ་མ་ལྟ་བུའོ།
en: replied Subhūti. “Those beings are like a magical display, and those who listen to the Dharma are also like a magical display.

source: །སེམས་ཅན་དེ་དག་ནི་སྤྲུལ་པ་ལྟ་བུ་སྟེ། ཆོས་ཉན་པ་དེ་དག་ཀྱང་སྤྲུལ་པ་ལྟ་བུའོ།
en: Those beings are like a phantom, and those who listen to the Dharma are also like a phantom.

source: །ལྷའི་བུ་དག་སེམས་ཅན་དེ་དག་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: Divine princes, those beings are like a dream, like a magical display. “

source: །ལྷའི་བུ་དག་གཟུགས་ཀྱང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: Divine princes, physical forms are also like a dream, like a magical display.

source: །ལྷའི་བུ་དག་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: Divine princes, feelings, perceptions, formative predispositions, and consciousness are also like a dream, like a magical display.

source: །ལྷའི་བུ་དག་མིག་ཀྱང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: Divine princes, the eyes are also like a dream, like a magical display.

source: །རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་། ཡིད་ཀྱང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: The ears, the nose, the tongue, the body, and the mental faculty are also like a dream, like a magical display.

source: །གཟུགས་ཀྱང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: Divine princes, sights are also like a dream, like a magical display. {Ki.

source: །སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་དང་། ཆོས་ཀྱང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: II-III: 15} Sounds, odors, tastes, tangibles, and mental phenomena are also like a dream, like a magical display.

source: །མིག་གི་རྣམ་པར་ཤེས་པ་ཡང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: Visual consciousness is also like a dream, like a magical display.

source: །རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ཡང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: Auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness are also like a dream, like a magical display.

source: །མིག་གི་འདུས་ཏེ་རེག་པ་ཡང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: Visually compounded sensory contact is also like a dream, like a magical display.

source: །རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ཡང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: Aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact are also like a dream, like a magical display.

source: །མིག་གི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་ཡང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: Feelings arising from visually compounded sensory contact are also like a dream, like a magical display.

source: །རྣ་བའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བ་ཡང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: Feelings arising from aurally compounded sensory contact, feelings arising from nasally compounded sensory contact, feelings arising from lingually compounded sensory contact, feelings arising from corporeally compounded sensory contact, and feelings arising from mentally compounded sensory contact are also like a dream, like a magical display.

source: །སའི་ཁམས་ཀྱང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: The earth element is also like a dream, like a magical display.

source: །ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: The water element, the fire element, the wind element, the space element, and the consciousness element are also like a dream, like a magical display.

source: །མ་རིག་པ་ཡང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ། །འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དང་། མིང་དང་གཟུགས་དང་།
en: Fundamental ignorance is also like a dream, like a magical display.

source: སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་ཚོར་བ་དང་། སྲེད་པ་དང་ལེན་པ་དང་། སྲིད་པ་དང་སྐྱེ་བ་དང་། རྒ་ཤི་ཡང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: Formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, and aging and death are also like a dream, like a magical display. “

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: The perfection of generosity is also like a dream, like a magical display.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: The perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are also like a dream, like a magical display.

source: །ནང་སྟོང་པ་ཉིད་ཀྱང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: The emptiness of internal phenomena is also like a dream, like a magical display.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ཡང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: The [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are also like a dream, like a magical display.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ། །ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་།
en: The applications of mindfulness are also like a dream, like a magical display.

source: སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: The correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are also like a dream, like a magical display.

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the distinct qualities of the buddhas are also like a dream, like a magical display. “

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ། །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཡང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: The fruit of entering the stream to nirvāṇa is also like a dream, like a magical display.

source: །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ཀྱང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: The fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, and individual enlightenment are also like a dream, like a magical display.

source: །ལྷའི་བུ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུའོ།
en: Divine princes, complete enlightenment is also like a dream, like a magical display.”

source: །དེ་ནས་ལྷའི་བུ་དེ་དག་གིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་རབ་འབྱོར་བྱང་ཆུབ་ཀྱང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུར་བཤད་ན། མྱ་ངན་ལས་འདས་པ་ཡང་ཅི་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུར་བཤད་དམ།
en: Then, the gods asked the venerable Subhūti, “Blessed Subhūti, when you say that enlightenment is also like a dream, like a magical display, in that case do you also say that nirvāṇa is like a dream, like a magical display?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ལྷའི་བུ་དག་བདག་ནི་མྱ་ངན་ལས་འདས་པ་ཡང་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུར་སྨྲ་སྟེ།
en: Divine princes, I do say that nirvāṇa also is like a dream, like a magical display,” replied Subhūti. “

source: དེ་བས་གལ་ཏེ་མྱ་ངན་ལས་འདས་པ་ལས་ཁྱད་པར་དུ་འཕགས་པའི་ཆོས་གཞན་ཞིག་ཡོད་ན་ཡང་། དེ་ལ་བདག་ནི་རྨི་ལམ་ལྟ་བུ་སྒྱུ་མ་ལྟ་བུར་སྨྲའོ།
en: If there were anything else more sublime than nirvāṇa, that too, I say, would be like a dream, like a magical display.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ལྷའི་བུ་དག་དེ་ནི་འདི་ལྟར་རྨི་ལམ་ལྟ་བུ་དང་། སྒྱུ་མ་ལྟ་བུ་དང་། མྱ་ངན་ལས་འདས་པ་དེ་ལ་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དང་། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་མཛོད་ལྡན་ཆེན་པོ་དང་།
en: If you ask why, divine princes, it is because being like a dream and being like a magical display on the one hand, and nirvāṇa on the other, are not two things, and are not to be divided into two.”

source: ཚེ་དང་ལྡན་པ་ཀ་ཏྱའི་བུ་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་བྱམས་གང་གི་བུ་དང་། ཚེ་དང་ལྡན་པ་འོད་སྲུངས་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཕྲག་དུ་མས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then, the venerable Śāradvatīputra, the venerable Mahā­maudgalyāyana, the venerable Mahākauṣṭhila, the venerable Mahākātyāyana, the venerable Pūrṇa Maitrāyaṇīputra, and the venerable Mahākāśyapa, along with many thousands of bodhisattvas, inquired of the venerable Subhūti, “Blessed Subhūti, who will have confidence in this perfection of wisdom, which is so profound, {Ki.

source: །བཙུན་པ་རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལྟར་ཟབ་པ། འདི་ལྟར་བལྟ་དཀའ་བ་འདི་ལྟར་རྟོགས་པར་དཀའ་བ་འདི་ལྟར་ཞི་བ་འདི་ལྟར་གསལ་བ་འདི་ལྟར་ཕྲ་བ་འདི་ལྟར་བཟང་བ་འདི་ལ་སུ་དག་ཡིད་ཆེས་པར་འགྱུར།
en: II-III: 16} so hard to discern, so hard to realize, so peaceful, so clear, so subtle, and so noble?”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་དག་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལྟར་ཟབ་པ་འདི་ལྟར་ཤིན་དུ་བརྟག་དཀའ་བ་འདི་ལྟར་ཕྲ་བ། འདི་ལྟར།
en: Then the venerable Subhūti replied to those great śrāvakas and those bodhisattva great beings, “Venerable ones!

source: གསལ་བ། འདི་ལྟར་རྟོགས་པར་དཀའ་བ། འདི་ལྟར་ཞི་བ་འདི་ལྟར་བཟང་བ། འདི་ལྟར་ཤིན་དུ་འཕགས་པ། འདི་ལྟར་མཁས་ཤིང་ཤེས་པས་རིག་པར་བྱ་བ་འདི་ལ་ཡིད་ཆེས་པར་འགྱུར་རོ། །བདེན་པ་མཐོང་བའི་གང་ཟག་གམ།
en: Irreversible bodhisattvas will have confidence in this perfection of wisdom, which is so profound, which is extremely hard to investigate, which is so subtle, so clear, so hard to realize, so peaceful, so noble, so utterly sublime, and which is to be known by the learned and the wise.

source: དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ་བསམ་པ་ཡོངས་སུ་རྫོགས་པའམ། སྔོན་གྱི་རྒྱལ་བ་ལ་བྱ་བ་བྱས་པའི་སེམས་ཅན་སངས་རྒྱས་བྱེ་བ་མང་པོ་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་བསྐྱེད་པ་དག་དང་། རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་ཟིན་པ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལྟར་ཟབ་པ། འདི་ལྟར་བརྟག་དཀའ་བ། འདི་ལྟར་བརྟག་པའི་སྤྱོད་ཡུལ་མ་ཡིན་པ། འདི་ལྟར་བལྟ་དཀའ་བ་འདི་ལྟར་རྟོགས་པར་དཀའ་བ། འདི་ལྟར་ཞི་བ། འདི་ལྟར་ཤིན་དུ་འཕགས་པ་མཁས་ཤིང་ཤེས་པས་རིག་པར་བྱ་བ་འདི་ལ་ཡིད་ཆེས་པར་འགྱུར་བ་དེ་དག་ནི།
en: Those individuals who discern the truth, arhats who are free from contaminants and who have fulfilled their intentions, beings who have carried out their duties with respect to the conquerors of the past and cultivated the roots of virtuous action under many tens of millions of buddhas, and noble sons or noble daughters who have been accepted by a spiritual mentor—all of these will have confidence in this perfection of wisdom, which is so profound, so hard to investigate, so hard to discern, so hard to realize, so peaceful, so utterly sublime, and which is to be known by the learned and the wise. “

source: གཟུགས་སྟོང་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར། སྟོང་པ་ཉིད་གཟུགས་ཤེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ།
en: They will not construe the notion that physical forms are empty, and they will not construe the notion that emptiness is physical forms.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྟོང་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར། །སྟོང་པ་ཉིད་རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ།
en: They will not construe the notion that feelings, perceptions, formative predispositions, and consciousness are empty, and they will not construe the notion that emptiness is consciousness [and the aforementioned aggregates].

source: །གཟུགས་མཚན་མ་མེད་ཅེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར། མཚན་མ་མེད་པ་གཟུགས་ཤེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ།
en: They will not construe the notion that physical forms are signless, and they will not construe the notion that signlessness is physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མཚན་མ་མེད་ཅེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར། མཚན་མ་མེད་པ་རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ།
en: They will not construe the notion that feelings, perceptions, formative predispositions, and consciousness are signless, and they will not construe the notion that signlessness is consciousness [and so forth].

source: །གཟུགས་སྨོན་པ་མེད་ཅེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར། སྨོན་པ་མེད་པ་གཟུགས་ཤེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ།
en: They will not construe the notion that physical forms are wishless, and they will not construe the notion that wishlessness is physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྨོན་པ་མེད་ཅེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར། སྨོན་པ་མེད་པ་རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ།
en: They will not construe the notion that feelings, perceptions, formative predispositions, and consciousness are wishless, and they will not construe the notion that wishlessness is consciousness [and so forth].

source: །གཟུགས་སྐྱེ་བ་མེད་ཅེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར། སྐྱེ་བ་མེད་པ་གཟུགས་ཤེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ།
en: They will not construe the notion that physical forms are nonarising, and they will not construe the notion that nonarising is physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྐྱེ་བ་མེད་ཅེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར། སྐྱེ་བ་མེད་པ་རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ།
en: They will not construe the notion that feelings, perceptions, formative predispositions, and consciousness are nonarising, and they will not construe the notion that nonarising is consciousness [and so forth].

source: །གཟུགས་འགག་པ་མེད་ཅེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར། འགག་པ་མེད་པ་གཟུགས་ཤེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ།
en: They will not construe the notion that physical forms are unceasing, and they will not construe the notion that noncessation is physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་འགག་པ་མེད་ཅེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར། འགག་པ་མེད་པ་རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ།
en: They will not construe the notion that feelings, perceptions, formative predispositions, and consciousness are unceasing, and they will not construe the notion that noncessation is consciousness [and so forth].

source: །གཟུགས་ཞི་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར། ཞི་བ་གཟུགས་ཤེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ།
en: They will not construe the notion that physical forms are peace, and they will not construe the notion that peace is physical forms.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཞི་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར། ཞི་བ་རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ།
en: They will not construe the notion that feelings, perceptions, formative predispositions, and consciousness are peace, and they will not construe the notion that peace is consciousness [and so forth].

source: །གཟུགས་དབེན་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར། དབེན་པ་གཟུགས་ཤེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ།
en: They will not construe the notion that physical forms are void, and they will not construe the notion that voidness is physical forms.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དབེན་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར། དབེན་པ་རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ།
en: They will not construe the notion that feelings, perceptions, formative predispositions, and consciousness are void, and they will not construe the notion that voidness is consciousness [and so forth]. “

source: །མིག་སྟོང་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར། སྟོང་པ་ཉིད་མིག་ཅེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ།
en: They will not construe the notion that the eyes are empty, and they will not construe the notion that emptiness is the eyes.

source: །རྣ་བ་དང་སྣ་དང་། ལྕེ་དང་ལུས་དང་། ཡིད་སྟོང་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར། སྟོང་པ་ཉིད་ཡིད་ཅེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ།
en: They will not construe the notion that the ears, nose, tongue, body, and mental faculty are empty, and they will not construe the notion that emptiness is the mental faculty [and so forth].
